Courses/7140/Lectures/Design/design-doc.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Design Documentation</title>
<!-- 2018-09-27 Thu 22:14 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Software Engineering Lecture"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../Top/index.html"> HOME </a>
</div><div id="preamble" class="status">
<a href="../../">../../</a> 2015-06-10
</div>
<div id="content">
<h1 class="title">Design Documentation</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Description of a Design</a>
<ul>
<li><a href="#sec-1-1">1.1. Req v Spec v Design Docs</a></li>
<li><a href="#sec-1-2">1.2. Current Practice</a></li>
</ul>
</li>
<li><a href="#sec-2">2. VHLL: Very High Level Languages</a>
<ul>
<li><a href="#sec-2-1">2.1. VHLL components</a></li>
</ul>
</li>
<li><a href="#sec-3">3. Design rationale</a></li>
<li><a href="#sec-4">4. Document Format</a></li>
<li><a href="#sec-5">5. References</a></li>
<li><a href="#sec-6">6. End</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Description of a Design</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Recall that: A spec is a relationship between IO, expressed using
discrete math, logic, and grammars.  We prefer it to be
declarative.  But, occasionally we do use an older version of a
program to be a spec for a new version to be built, with additional
spec details added.
</li>

<li>A design is a how-to expressed in a high-level notation, far higher
than typical programming languages such as C++ and Java.
</li>
</ol>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Req v Spec v Design Docs</h3>
<div class="outline-text-3" id="text-1-1">
<ol class="org-ol">
<li>A Spec Doc overlaps with Req Doc
</li>
<li>Spec Doc should cite the Req Doc
<ol class="org-ol">
<li>But Spec Doc should be self-contained.
</li>
<li>Motivational paragraphs are relevent in Req Docs.
</li>
<li>Not in Spec Docs.
</li>
<li>Remember the cliche: The "what" is the spec, the "how" is the design.
</li>
</ol>
</li>
<li>Design Doc should cite the Req and Spec Docs
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Current Practice</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>Prose descriptions in English
</li>
<li>Figures: UML, data flow, block diagrams
</li>
<li>All global data structures/ classes
</li>
<li>Collections of methods and their code
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> VHLL: Very High Level Languages</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>Consider a design to be a VHLL program, i.e., executable.
</li>
<li>Psuedo Code <a href="http://en.wikipedia.org/wiki/Pseudocode">http://en.wikipedia.org/wiki/Pseudocode</a>
</li>
<li>All programs, in particular "First Time" Programs, should be
prototyped in VHLL.
</li>
<li>Python and other languages at that "level" are acceptable, but
make up an appropriate VHLL, at a higher level.
</li>
</ol>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> VHLL components</h3>
<div class="outline-text-3" id="text-2-1">
<ol class="org-ol">
<li>High-Level Data Structures: Sets, Sequences, Tables, Maps, &#x2026;
</li>
<li>High-Level Operations: Matrix ops, Bag Intersect, &#x2026;
</li>
<li>High-Level Control Structures: Map/Reduce, Higher Order Funcs,
Concurrency, &#x2026;
</li>
<li>Ex: Book "Domain Specific Languages", by Martin Fowler, 2010.  See below
</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Design rationale</h2>
<div class="outline-text-2" id="text-3">
<p>
"A design rationale is the explicit listing of decisions made during a
design process, and the reasons why those decisions were made. Its
primary goal is to support designers by providing a means to record
and communicate the argumentation and reasoning behind the design
process.  It should therefore include:
</p>

<ul class="org-ul">
<li>the reasons behind a design decision,
</li>
<li>the justification for it,
</li>
<li>the other alternatives considered,
</li>
<li>the trade offs evaluated, and
</li>
<li>the argumentation that led to the decision."
</li>
<li>[from Wikipedia]
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Document Format</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>By now you have read a number of peer-reviewed academic
papers. Follow their style; e.g., follow JML fmdoc.pdf. Technical
Reports are more generous with page layouts, and such.
</li>
<li>Cover Page
</li>
<li>Abstract
</li>
<li>All pages, except cover page, are numbered Table of Contents (TOC)
Sections: Sections must be numbered also; Typical: Three levels;
too many: &gt; 5 First Section <code>= "Introduction" 1. Last Section =</code>
"Conclusion" Unnumbered "References" Section; Cite them. See
Chicago Manual of Style. 7 Misc
</li>
</ol>
</div>
</div>


<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> References</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li><a href="http://en.wikipedia.org/wiki/Design_rationale">http://en.wikipedia.org/wiki/Design_rationale</a>.  Required Reading.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> End</h2>
<div class="outline-text-2" id="text-6">
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2015 &bull; <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a> &bull; 2015-06-10
</div>
</body>
</html>
